i am also facing the following same type of issue but above solution donot solve my issue .
my source code is :

resource "aws_instance" "lms-ec2-apache" {
  ami ="${var.aws_ami}"
  instance_type ="${var.instance_type}"
  key_name ="${aws_key_pair.lms-ec2-apache.id}"
  subnet_id ="${var.subnet_id}"

  security_groups =["${aws_security_group.lms-ec2-apache.id}"]
  tags = {
  Name = "lms-ec2-apache"
  key_name ="${aws_key_pair.lms-ec2-apache.id}"
  }
}

terraform plan gives:

Terraform will perform the following actions:

  # module.ec2-apache.aws_instance.lms-ec2-apache must be replaced
-/+ resource "aws_instance" "lms-ec2-apache" {
        ami                          = "ami-0c5204531f799e0c6"
      ~ arn                          = "arn:aws:ec2:us-west-2:157369949994:instance/i-0e327fcf07c83bcce" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-west-2b" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
        get_password_data            = false
      + host_id                      = (known after apply)
      ~ id                           = "i-0e327fcf07c83bcce" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.micro"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
        key_name                     = "lms_apache_key"
      - monitoring                   = false -> null
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-04c6bb59dcbfa1ef0" -> (known after apply)
      ~ private_dns                  = "ip-10-0-0-247.us-west-2.compute.internal" -> (known after apply)
      ~ private_ip                   = "10.0.0.247" -> (known after apply)
      + public_dns                   = (known after apply)
      ~ public_ip                    = "54.186.141.77" -> (known after apply)
      ~ security_groups              = [ # forces replacement
          + "sg-0a2d2571db088d018",
        ]
        source_dest_check            = true
        subnet_id                    = "subnet-0529e3e3e3fa9c434"
        tags                         = {
            "Name"     = "lms-ec2-apache"
            "key_name" = "lms_apache_key"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ volume_tags                  = {} -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-0a2d2571db088d018",
        ] -> (known after apply)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = false -> null
          - iops                  = 300 -> null
          - volume_id             = "vol-0e69f47369af4489b" -> null
          - volume_size           = 100 -> null
          - volume_type           = "gp2" -> null
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 150 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "vol-001ebe82b2b50619f" -> (known after apply)
          ~ volume_size           = 50 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

anyone please help asap .
